

export default {
	// 国籍（户籍）
	account_type: { "城镇户籍": "11", "农村户籍": "12", "香港": "16", "澳门": "14", "台湾": "15", "外国籍": "02", "无国籍": "03", "其他": "13", "中国籍": "01", "大陆": "10" },
	// 国家
	"common-country": { "无": "0", "南极洲": "10", "保加利亚": "100", "缅甸": "104", "布隆迪": "108", "白俄罗斯": "112", "柬埔寨": "116", "阿尔及利亚": "12", "喀麦隆": "120", "加拿大": "124", "佛得角": "132", "开曼群岛": "136", "中非": "140", "斯里兰卡": "144", "乍得": "148", "智利": "152", "中国": "156", "中国（台湾居民）": "158", "美属萨摩亚": "16", "圣诞岛": "162", "科科斯(基林)群岛": "166", "哥伦比亚": "170", "科摩罗": "174", "马约特": "175", "刚果": "178", "扎伊尔": "180", "库克群岛": "184", "哥斯达黎加": "188", "克罗地亚": "191", "古巴": "192", "塞浦路斯": "196", "安道尔": "20", "捷克": "203", "贝宁": "204", "丹麦": "208", "多米尼克": "212", "多米尼加共和国": "214", "厄瓜多尔": "218", "萨尔瓦多": "222", "赤道几内亚": "226", "埃塞俄比亚": "231", "厄立特里亚": "232", "爱沙尼亚": "233", "法罗群岛": "234", "马尔维纳斯群岛(福克兰群岛)": "238", "南乔治亚岛和南桑德韦奇岛": "239", "安哥拉": "24", "斐济": "242", "芬兰": "246", "法国": "250", "法属圭亚那": "254", "法属波利尼西亚": "258", "法属南部领土": "260", "吉布提": "262", "加蓬": "266", "格鲁吉亚": "268", "冈比亚": "270", "德国": "276", "安提瓜和巴布达": "28", "加纳": "288", "直布罗陀": "292", "基里巴斯": "296", "希腊": "300", "格陵兰": "304", "格林纳达": "308", "阿塞拜疆": "31", "瓜德罗普": "312", "关岛": "316", "阿根廷": "32", "危地马拉": "320", "几内亚": "324", "圭亚那": "328", "海地 Haiti": "332", "赫德岛和麦克唐纳岛": "334", "梵蒂冈": "336", "洪都拉斯": "340", "香港": "344", "匈牙利": "348", "冰岛": "352", "印度": "356", "澳大利亚": "36", "印度尼西亚": "360", "伊朗": "364", "伊拉克": "368", "巴勒斯坦": "374", "以色列": "376", "意大利": "380", "科特迪瓦": "384", "牙买加": "388", "日本": "392", "哈萨克斯坦": "398", "阿富汗": "4", "奥地利": "40", "肯尼亚": "404", "朝鲜": "408", "韩国": "410", "科威特": "414", "吉尔吉斯斯坦": "417", "老挝": "418", "黎巴嫩": "422", "莱索托": "426", "拉脱维亚": "428", "利比里亚": "430", "利比亚": "434", "列支敦士登": "438", "巴哈马": "44", "立陶宛": "440", "卢森堡": "442", "澳门": "446", "马达加斯加": "450", "马拉维": "454", "马来西亚": "458", "马尔代夫": "462", "马里": "466", "马耳他": "470", "马提尼克": "474", "毛里塔尼亚": "478", "巴林": "48", "毛里求斯": "480", "墨西哥": "484", "摩纳哥": "492", "蒙古": "496", "摩尔多瓦": "498", "孟加拉国": "50", "蒙特塞拉特": "500", "摩洛哥": "504", "莫桑比克": "508", "亚美尼亚": "51", "阿曼": "512", "纳米比亚": "516", "巴巴多斯": "52", "瑙鲁": "520", "尼泊尔": "524", "荷兰": "528", "荷属安的列斯": "530", "阿鲁巴": "533", "新喀里多尼亚": "540", "瓦努阿图": "548", "新西兰": "554", "尼加拉瓜": "558", "尼日尔": "562", "尼日利亚": "566", "纽埃": "570", "诺福克岛": "574", "挪威": "578", "北马里亚纳": "580", "美属太平洋各群岛": "581", "密克罗尼西亚": "583", "马绍尔群岛": "584", "帕劳": "585", "巴基斯坦": "586", "巴拿马": "591", "巴布亚新几内亚": "598", "百慕大": "60", "巴拉圭": "600", "秘鲁": "604", "菲律宾": "608", "皮特凯恩群岛": "612", "波兰": "616", "葡萄牙": "620", "几内亚比绍": "624", "东帝汶": "626", "波多黎各": "630", "卡塔尔": "634", "留尼汪": "638", "不丹": "64", "罗马尼亚": "642", "俄罗斯": "643", "卢旺达": "646", "圣赫勒拿": "654", "圣基茨和尼维斯": "659", "安圭拉": "660", "圣卢西亚": "662", "圣皮埃尔和密克隆": "666", "圣文森特和格林纳丁斯": "670", "圣马力诺": "674", "圣多美和普林西比": "678", "玻利维亚": "68", "沙特阿拉伯": "682", "塞内加尔": "686", "塞舌尔": "690", "塞拉利昂": "694", "波斯尼亚和黑塞哥维那": "70", "新加坡": "702", "斯洛伐克": "703", "越南": "704", "斯洛文尼亚": "705", "索马里": "706", "南非": "710", "津巴布韦": "716", "博茨瓦纳": "72", "西撒哈拉": "732", "苏丹": "736", "布维岛": "74", "苏里南": "740", "斯瓦尔巴群岛": "744", "斯威士兰": "748", "瑞典": "752", "瑞士": "756", "叙利亚": "760", "塔吉克斯坦": "762", "泰国": "764", "多哥": "768", "托克劳": "772", "汤加": "776", "特立尼达和多巴哥": "780", "阿联酋": "784", "突尼斯": "788", "土耳其": "792", "土库曼斯坦": "795", "特克斯科斯群岛": "796", "图瓦卢": "798", "阿尔巴尼亚": "8", "乌干达": "800", "乌克兰": "804", "马斯顿": "807", "埃及": "818", "英国": "826", "坦桑尼亚": "834", "伯利兹": "84", "美国": "840", "美属维尔京群岛": "850", "布基纳法索": "854", "乌拉圭": "858", "英属印度洋领土": "86", "乌兹别克斯坦": "860", "委内瑞拉": "862", "瓦利斯和富图纳": "876", "萨摩亚": "882", "也门": "887", "南斯拉夫": "891", "赞比亚": "894", "巴西": "895", "约旦": "896", "比利时": "897", "西班牙": "898", "所罗门群岛": "90", "英属维尔京群岛": "92", "文莱": "96", "黑山": "997", "爱尔兰": "372" },
	// 移交罪犯机关
	sqjzjdjg: { "人民法院": "01", "公安机关": "02", "监狱管理机关": "03" },
	// 社区矫正对象决定机关
	yjzfjg: { "监狱": "01", "看守所": "02", "公安局": "03", "其它": "04" },
	// 文化程度
	'common-edu_bg': { "文盲": "01", "小学": "02", "初中": "03", "高中": "04", "中专和中技": "09", "大专": "05", "本科": "06", "硕士": "07", "博士及以上（包含博士）": "08", "其他": "99" },
	// 婚姻状况
	sfb_hyzk: { "未婚": "01", "已婚": "02", "离异": "03", "丧偶": "04" },
	// 政治面貌
	political_status:{"中共党员":"01","中共预备党员":"02","共青团员":"03","民革党员":"04","民盟盟员":"05","民建会员":"06","民进会员":"07","农工党党员":"08","致公党党员":"09","九三学社社员":"10","台盟盟员":"11","群众":"13","无党派民主人士":"12","国民党":"14","外国情报人员":"103","反动会道门成员":"104","敌特组织成员":"105","其他":"99"},
	// 矫正类型
	'common-outside_type':{"管制":"01","缓刑":"02","假释":"03","暂予监外执行":"04","其他":"99"},
	// 身体状况
	zyjwzxrystzk:{"严重疾病":"01","怀孕或哺乳":"02","生活不能自理":"03"},
	// 有无
	'approve-flag':{"无":"0","有":"1"},
	// 是否
	'common-is_or_not':{"否":"0","是":"1"},
	// 健康状况
	sfb_jkzk:{"良好":"1","一般":"2","较差":"3"},
	// 就业就学情况
	jyjx:{"就业":"02","就学":"01","务农":"03","无业":"04"},
	// 被捕前职业
	pqzy:{"国家工作人员":"01","现役军人":"02","工人":"03","农民":"04","职员":"05","私企业主、个体劳动者":"06","学生":"07","离退休人员":"08","无业人员":"09","其他":"10"},
	// 国家工作人员类别
	gjgzrylb:{"国家机关":"01","国有公司或企业":"02","金融机构":"03","事业单位":"04","人民团体":"05","其他":"06"},
	// 工人具体状况
	grjtzk:{"在业":"01","下岗":"02"},
	// 农民具体状况
	nmjtzk:{"民工":"01","其他":"02"},
	// 具体传染病史
	jtcrbs:{"艾滋病":"01","肺结核":"02","病毒性肝炎":"03","传染性非典型肺炎":"04","流行性乙型脑炎":"05","禽流感":"06","麻疹":"07","登革热":"08","狂犬病":"09","淋病、梅毒":"10","其它传染病":"11"},
	// 前科类型
	qklx:{"行政处罚":"01","刑事处罚":"02"},
	// 文书类型
	wslx:{"其他":"0","刑事判决书":"1","刑事裁定书":"2","暂予监外执行决定书(通知书)":"3"},
	resume_duty:{"中国共产党机关负责人":"10100","国家机关负责人":"10200","民主党派和工商联负责人":"10300","人民团体和群众团体、社会组织及其他成员组织负责人":"10400","基层群众自治组织负责人":"10500","企事业单位负责人":"10600","哲学研究人员":"20100","工程技术人员":"20200","农业技术人员":"20300","飞机和船舶技术人员":"20400","卫生专业技术人员":"20500","经济和金融专业人员":"20600","法律、社会和宗教专业人员":"20700","教学人员":"20800","文学艺术、体育专业人员":"20900","新闻出版、文化专业人员":"21000","其他专业技术人员":"29900","办事人员":"30100","安全和消防人员":"30200","其他办事人员和有关人员":"39900","批发与零售服务人员":"40100","交通运输、仓储和邮政业服务人员":"40200","住宿和餐饮服务人员":"40300","信息传输、软件和信息技术服务人员":"40400","金融服务人员":"40500","房地产服务人员":"40600","租赁和商务服务人员":"40700","技术辅助服务人员":"40800","水利、环境和公共设施管理服务人员":"40900","居民服务人员":"41000","电力、燃气及水供应服务人员":"41100","修理及制作服务人员":"41200","文化、体育及娱乐服务人员":"41300","健康服务人员":"41400","农、林、牧、渔业生产及辅助人员":"50000","农业生产人员":"50100","林业生产人员":"50200","畜牧业生产人员":"50300","渔业生产人员":"50400","农林牧渔生产辅助人员":"50500","其他农、林、牧、渔、水利业生产人员":"59900","农副产品加工人员":"60100","食品、饮料生产加工人员":"60200","烟草及其制品加工人员":"60300","纺织、针织、印染人员":"60400","纺织品、服装和皮革、皮毛制品加工制作人员":"60500","木材加工、农具与木制品制作人员":"60600","纸及纸制品生产加工人员人员":"60700","印刷和记录媒介复制人员":"60800","文教、工美体育和娱乐用品制作人员":"60900","石油加工和炼焦、煤化工制作人员":"61000","化学原料和化学制品制造人员":"61100","医药制造人员":"61200","化学纤维制造人员":"61300","橡胶和塑料制品制造人员":"61400","非金属矿物制品制造人员":"61500","采矿人员":"61600","金属冶炼和压延加工人员":"61700","机械制造基础加工人员":"61800","金属制品制造人员":"61900","通用设备制造人员":"62000","专用设备制造人员":"62100","汽车制造人员":"62200","铁路、船舶、航空设备制造人员":"62300","电气机械和器材制造人员":"62400","计算机、通信、和其他电子设备制造人员":"62500","仪器仪表制造人员":"62600","废弃资源综合利用人员":"62700","电力、热力、气体、水生产和输配人员":"62800","建筑施工人员":"62900","运输设备和通用工程机械操作人员及有关人员":"63000","生产辅助人员":"63100","其他生产制造及有关人员":"69900","军人":"70000","不便分类的其他从业人员":"80000","学生":"90000","无业":"91000"},
	'common-family-relationship':{"本人或户主":"01","配偶":"02","子":"03","女":"04","孙子孙女或外孙子外孙女":"05","父母":"06","祖父母或外祖父母":"07","兄、弟、姐、妹":"08","其他":"99"},
	yys: {"电信": '1', "联通": '2', "移动": '3'},
	dzdwfs: {"基站": "01", "腕表": "02"},
	hzbczt: {"社区矫正机构保管": "01","失效": "02","遗失": "03","注销": "04","被其他机关扣押":"05","自行保存":"06"}
}